namespace :states do
  desc "Delete all states and insert for Ukraine"
  task :update => :environment do
    country = Spree::Country.find_by_iso('UA')

    if country
      Spree::State.delete_all
      states = [
        ["Автономная Республика Крым", "UA-43"],
        ["Винницкая область", "UA-05"],
        ["Волынская область", "UA-07"],
        ["Днепропетровская область", "UA-12"],
        ["Донецкая область", "UA-14"],
        ["Житомирская область", "UA-18"],
        ["Закарпатская область", "UA-21"],
        ["Запорожская область", "UA-23"],
        ["Ивано-Франковская область", "UA-26"],
        ["Киевская область", "UA-32"],
        ["Кировоградская область", "UA-35"],
        ["Луганская область", "UA-09"],
        ["Львовская область", "UA-46"],
        ["Николаевская область", "UA-48"],
        ["Одесская область", "UA-51"],
        ["Полтавская область", "UA-53"],
        ["Ровненская область", "UA-56"],
        ["Сумская область", "UA-59"],
        ["Тернопольская область", "UA-61"],
        ["Харьковская область", "UA-63"],
        ["Херсонская область", "UA-65"],
        ["Хмельницкая область", "UA-68"],
        ["Черкасская область", "UA-71"],
        ["Черниговская область", "UA-74"],
        ["Черновицкая область", "UA-77"]
      ].each do |state|
        Spree::State.create(name: state[0], abbr: state[1], country_id: country.id)
      end
    end
  end
end